# Quiz 4

Data transformation and visualization

1. What is the `shape` of a DataFrame?

2. How would I create a bar chart of the values in column 3 given this dataframe

In [96]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

data = np.random.randn(4,5)
df = pd.DataFrame(data)
df.index = ['A','B','C','D']
df

          0         1         2         3         4
A -1.933095 -1.631878  1.025763 -0.227709  0.237235
B -0.062418 -0.253116 -0.833613  0.450493 -1.895938
C -1.146091  0.745927 -0.591740 -0.735269  1.039825
D -1.158863  0.516311  1.238701 -0.407789 -0.422654

2. How would I create a line chart containing only the values in column 2 and 3?

4. How would we filter the following DataFrame to only contain data values greater than 5?

In [97]:
import pandas as pd

df = pd.DataFrame({"key":['A','B','C','A','B','C','A','B','C',],
                      "data":[0,5,10,5,10,15,10,15,20]})
df

  key  data
0   A     0
1   B     5
2   C    10
3   A     5
4   B    10
5   C    15
6   A    10
7   B    15
8   C    20

4. How would sum up all of the elements in the same DataFrame by `key`, that is, create a new DataFrame that is the sum of all of the values with the key 'A', then 'B' and then 'C' using `groupby`?

5. How would we use the `pivot_table` function to do the same thing?